# Лабораторна робота 1, завдання 1 (ліва частина)
# Перекласти запис 10111 з системи числення з основою P = 2, 8, 16 до системи числення з основою 10

#з основою 2
binary_number = 0b10111
print("Двійкове 10111 це десяткове", binary_number)
#або
print("другий спосіб", 1 * 2 ** 4 + 0 * 2 ** 3 + 1 * 2 ** 2 + 1 * 2 ** 1 + 1 * 2 ** 0)
print(int(binary_number, ))

#з основою 8
oct_number = 0o10111
print(oct_number)
print("Вісімкове 10111 це десяткове", oct_number)
#або
print("другий спосіб", 1 * 8 ** 4 + 0 * 8 ** 3 + 1 * 8 ** 2 + 1 * 8 ** 1 + 1 * 8 ** 0)

#з основою 16
hex_number = 0x10111
print(hex_number)
print("Шістнадцяткове 10111 це десяткове", hex_number)
#або
print("другий спосіб", 1 * 16 ** 4 + 0 * 16 ** 3 + 1 * 16 ** 2 + 1 * 16 ** 1 + 1 * 16 ** 0)