# Лабораторна робота 1, завдання 15
# Пояснити неточності додавання і віднімання чисел з плаваючою точкою

sum1 = 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1 - 1.0
print("математично має дати 0, але дає:", sum1)

sum2 = 0.1 + 0.1 + 0.1 + 0.1 + 0.1 - 0.5
print("математично має дати 0, але дає:", sum2)

# Причина виникнення неочікуваних дробових частин -
# в математично "неправильному" відсіканні наближуючихся до нуля "хвостиків" довгих float
# при кожній операції додавання / віднімання, а отже десь пролазить помилка округлення
# в випадку sum2 операцій менше і помилки не встигають накопичитись для наочної появи помилки округлення