# Практична 2 задача 2

# Ініціалізація словника для зберігання даних про книги
books = {}

# 1. Введення даних про книги
while True:
    book_input = input("Введіть назву книги та автора, розділені комою (або 'stop' для завершення): ")
    # 2. Завершення вводу даних
    if book_input.lower() == 'stop':
        break
    try:
        book, author = book_input.split(',',1) # Розділяємо введення на назву книги та автора
        books[book.strip()] = author.strip() # Видаляємо зайві пробіли та зберігаємо дані
    except ValueError:
        print("Некоректний ввід, спробуйте ще раз.")

print("весь словник: ", books)
# 3. Запит назви книги для пошуку автора
book_to_find = input("Введіть назву книги для пошуку її автора: ")

# 4. Виведення результату пошуку
if book_to_find in books:
    print(f"Автор книги '{book_to_find}': {books[book_to_find]}")
else:
    print("Книга не знайдена в базі даних")