# Лабораторна робота 5 завдання 1
def f(n):
    if n <=0:
        return 0
    if n == 1:
        return 1
    return f(n - 1) + f(n - 2)
# а) це - функція отримання числового значення n-го члена послідовності Фібоначчі
# б, в) Часова складність - О(2 ** n) - кожен виклик функції породжує два рекурсивних виклики,
# кожен з яких породжує по два нових рекурсивних виклики й так далі. n - розмір вхідних даних

# г, д, е) Просторова складність, враховуючи специфіку об'єктної моделі мови Python - O(n) -
# відбувається послідовний обхід кожної гілки рекурсії в глибину, і повернення назад перед обчисленням
# наступної гілки рекурсії. таким чином пам'ять витрачається тільки на глибину однієї гілки під час всього виконання -
# після виконання рекурсивного виклику, його фрейм видаляється зі стеку і повертається тільки значення

def get_fibonacci_value_of_index(n):
    if n <= 0: return 0
    if n == 1: return 1
    a, b = 0, 1
    for _ in range(2, n + 1):
        next = a + b
        a = b
        b = next
    return b

import time

start_time = time.process_time()
print(get_fibonacci_value_of_index(36))
end_time = time.process_time()
print(f"ітеративний час для 36 елемента Фібоначчі: {end_time - start_time:.10f}")

start_time = time.process_time()
print(f(36))
end_time = time.process_time()
print(f"рекурсивний час для 36 елемента Фібоначчі: {end_time - start_time:.10f}")