# Лабораторна 7, завдання 1
# вираз, значення якого є список

a_list = [i for i in range(2, 20)]
b_list = [i*i for i in range(1, 11)]
c_list = [i*i for i in range(10, -1, -1)]
d_list = [i for i in range(0,101) if i % 2 and i % 3 and i % 5]

print("\nпослідовні цілі числа від 2 до 19 включно:\n", a_list)
print("\nквадрати послідовних цілих чисел від 1 до 10 включно:\n", b_list)
print("\nквадрати послідовних цілих чисел від 10 до 0 включно:\n", c_list)
print("\nЦілі числа від 0 до 100 включно, що не діляться на 2, 3 і 5:\n", d_list)